ulli-kroll/rtlwifi-usb/rtl8723bu/reg.h
#define	CAM_VALID				BIT(15)
#define	CAM_NOTVALID				0x0000
#define	CAM_USEDK				BIT(5)

#define	CAM_NONE				0x0
#define	CAM_WEP40				0x01
#define	CAM_TKIP				0x02
#define	CAM_AES					0x04
#define	CAM_WEP104				0x05

#define	TOTAL_CAM_ENTRY				32
#define	HALF_CAM_ENTRY				16

#define	CAM_WRITE				BIT(16)
#define	CAM_READ				0x00000000
#define	CAM_POLLINIG				BIT(31)

#define	SCR_USEDK				0x01
#define	SCR_TXSEC_ENABLE			0x02
#define	SCR_RXSEC_ENABLE			0x04

#define	WOW_PMEN				BIT(0)
#define	WOW_WOMEN				BIT(1)
#define	WOW_MAGIC				BIT(2)
#define	WOW_UWF					BIT(3)

/*********************************************
*       8723BE IMR/ISR bits
*********************************************
*/
#define	IMR_DISABLED				0x0
/* IMR DW0(0x0060-0063) Bit 0-31 */
#define	IMR_TXCCK		BIT(30)	/* TXRPT interrupt when
					 * CCX bit of the packet is set
					 */
#define	IMR_PSTIMEOUT		BIT(29)	/* Power Save Time Out Interrupt */
#define	IMR_GTINT4		BIT(28)	/* When GTIMER4 expires,
					 * this bit is set to 1
					 */
#define	IMR_GTINT3		BIT(27)	/* When GTIMER3 expires,
					 * this bit is set to 1
					 */
#define	IMR_TBDER		BIT(26)	/* Transmit Beacon0 Error */
#define	IMR_TBDOK		BIT(25)	/* Transmit Beacon0 OK */
#define	IMR_TSF_BIT32_TOGGLE	BIT(24)	/* TSF Timer BIT32 toggle
					 * indication interrupt
					 */
#define	IMR_BCNDMAINT0		BIT(20)	/* Beacon DMA Interrupt 0 */
#define	IMR_BCNDOK0		BIT(16)	/* Beacon Queue DMA OK0 */
#define	IMR_HSISR_IND_ON_INT	BIT(15)	/* HSISR Indicator (HSIMR & HSISR is
					 * true, this bit is set to 1)
					 */
#define	IMR_BCNDMAINT_E		BIT(14)	/* Beacon DMA Interrupt
					 * Extension for Win7
					 */
#define	IMR_ATIMEND		BIT(12)	/* CTWidnow End or ATIM Window End */
#define	IMR_HISR1_IND_INT	BIT(11)	/* HISR1 Indicator (HISR1 & HIMR1 is
					 * true, this bit is set to 1)
					 */
#define	IMR_C2HCMD		BIT(10)	/* CPU to Host Command INT Status,
					 * Write 1 clear
					 */
#define	IMR_CPWM2		BIT(9)	/* CPU power Mode exchange INT Status,
					 * Write 1 clear
					 */
#define	IMR_CPWM		BIT(8)	/* CPU power Mode exchange INT Status,
					 * Write 1 clear
					 */
#define	IMR_HIGHDOK		BIT(7)	/* High Queue DMA OK */
#define	IMR_MGNTDOK		BIT(6)	/* Management Queue DMA OK */
#define	IMR_BKDOK		BIT(5)	/* AC_BK DMA OK	*/
#define	IMR_BEDOK		BIT(4)	/* AC_BE DMA OK	*/
#define	IMR_VIDOK		BIT(3)	/* AC_VI DMA OK	*/
#define	IMR_VODOK		BIT(2)	/* AC_VO DMA OK	*/
#define	IMR_RDU			BIT(1)	/* Rx Descriptor Unavailable */
#define	IMR_ROK			BIT(0)	/* Receive DMA OK */

/* IMR DW1(0x00B4-00B7) Bit 0-31 */
#define	IMR_BCNDMAINT7		BIT(27)	/* Beacon DMA Interrupt 7 */
#define	IMR_BCNDMAINT6		BIT(26)	/* Beacon DMA Interrupt 6 */
#define	IMR_BCNDMAINT5		BIT(25)	/* Beacon DMA Interrupt 5 */
#define	IMR_BCNDMAINT4		BIT(24)	/* Beacon DMA Interrupt 4 */
#define	IMR_BCNDMAINT3		BIT(23)	/* Beacon DMA Interrupt 3 */
#define	IMR_BCNDMAINT2		BIT(22)	/* Beacon DMA Interrupt 2 */
#define	IMR_BCNDMAINT1		BIT(21)	/* Beacon DMA Interrupt 1 */
#define	IMR_BCNDOK7		BIT(20)	/* Beacon Queue DMA OK Interrup 7 */
#define	IMR_BCNDOK6		BIT(19)	/* Beacon Queue DMA OK Interrup 6 */
#define	IMR_BCNDOK5		BIT(18)	/* Beacon Queue DMA OK Interrup 5 */
#define	IMR_BCNDOK4		BIT(17)	/* Beacon Queue DMA OK Interrup 4 */
#define	IMR_BCNDOK3		BIT(16)	/* Beacon Queue DMA OK Interrup 3 */
#define	IMR_BCNDOK2		BIT(15)	/* Beacon Queue DMA OK Interrup 2 */
#define	IMR_BCNDOK1		BIT(14)	/* Beacon Queue DMA OK Interrup 1 */
#define	IMR_ATIMEND_E		BIT(13)	/* ATIM Window End Extension for Win7 */
#define	IMR_TXERR		BIT(11)	/* Tx Error Flag Interrupt Status,
					 * write 1 clear.
					 */
#define	IMR_RXERR		BIT(10)	/* Rx Error Flag INT Status,
					 * Write 1 clear
					 */
#define	IMR_TXFOVW		BIT(9)	/* Transmit FIFO Overflow */
#define	IMR_RXFOVW		BIT(8)	/* Receive FIFO Overflow */

#define	HWSET_MAX_SIZE			512
#define EFUSE_MAX_SECTION		64
#define EFUSE_REAL_CONTENT_LEN		256
#define EFUSE_OOB_PROTECT_BYTES		18 /* PG data exclude header,
					    * dummy 7 bytes frome CP test
					    * and reserved 1byte.
					    */

#define	EEPROM_DEFAULT_TSSI			0x0
#define EEPROM_DEFAULT_TXPOWERDIFF		0x0
#define EEPROM_DEFAULT_CRYSTALCAP		0x5
#define EEPROM_DEFAULT_BOARDTYPE		0x02
#define EEPROM_DEFAULT_TXPOWER			0x1010
#define	EEPROM_DEFAULT_HT2T_TXPWR		0x10

#define	EEPROM_DEFAULT_LEGACYHTTXPOWERDIFF	0x3
#define	EEPROM_DEFAULT_THERMALMETER		0x18
#define	EEPROM_DEFAULT_ANTTXPOWERDIFF		0x0
#define	EEPROM_DEFAULT_TXPWDIFF_CRYSTALCAP	0x5
#define	EEPROM_DEFAULT_TXPOWERLEVEL		0x22
#define	EEPROM_DEFAULT_HT40_2SDIFF		0x0
#define EEPROM_DEFAULT_HT20_DIFF		2
#define	EEPROM_DEFAULT_LEGACYHTTXPOWERDIFF	0x3
#define EEPROM_DEFAULT_HT40_PWRMAXOFFSET	0
#define EEPROM_DEFAULT_HT20_PWRMAXOFFSET	0

#define RF_OPTION1				0x79
#define RF_OPTION2				0x7A
#define RF_OPTION3				0x7B
#define EEPROM_RF_BT_SETTING_8723B		0xC3

#define EEPROM_DEFAULT_PID			0x1234
#define EEPROM_DEFAULT_VID			0x5678
#define EEPROM_DEFAULT_CUSTOMERID		0xAB
#define EEPROM_DEFAULT_SUBCUSTOMERID		0xCD
#define EEPROM_DEFAULT_VERSION			0

#define	EEPROM_CHANNEL_PLAN_FCC			0x0
#define	EEPROM_CHANNEL_PLAN_IC			0x1
#define	EEPROM_CHANNEL_PLAN_ETSI		0x2
#define	EEPROM_CHANNEL_PLAN_SPAIN		0x3
#define	EEPROM_CHANNEL_PLAN_FRANCE		0x4
#define	EEPROM_CHANNEL_PLAN_MKK			0x5
#define	EEPROM_CHANNEL_PLAN_MKK1		0x6
#define	EEPROM_CHANNEL_PLAN_ISRAEL		0x7
#define	EEPROM_CHANNEL_PLAN_TELEC		0x8
#define	EEPROM_CHANNEL_PLAN_GLOBAL_DOMAIN	0x9
#define	EEPROM_CHANNEL_PLAN_WORLD_WIDE_13	0xA
#define	EEPROM_CHANNEL_PLAN_NCC			0xB
#define	EEPROM_CHANNEL_PLAN_BY_HW_MASK		0x80

#define EEPROM_CID_DEFAULT			0x0
#define EEPROM_CID_TOSHIBA			0x4
#define	EEPROM_CID_CCX				0x10
#define	EEPROM_CID_QMI				0x0D
#define EEPROM_CID_WHQL				0xFE

#define	RTL8723BE_EEPROM_ID			0x8129

#define EEPROM_HPON				0x02
#define EEPROM_CLK				0x06
#define EEPROM_TESTR				0x08

#define EEPROM_TXPOWERCCK			0x10
#define	EEPROM_TXPOWERHT40_1S			0x16
#define EEPROM_TXPOWERHT20DIFF			0x1B
#define EEPROM_TXPOWER_OFDMDIFF			0x1B

#define	EEPROM_TX_PWR_INX			0x10

#define	EEPROM_CHANNELPLAN			0xB8
#define	EEPROM_XTAL_8723BE			0xB9
#define	EEPROM_THERMAL_METER_88E		0xBA
#define	EEPROM_IQK_LCK_88E			0xBB

#define	EEPROM_RF_BOARD_OPTION_88E		0xC1
#define	EEPROM_RF_FEATURE_OPTION_88E		0xC2
#define	EEPROM_RF_BT_SETTING_88E		0xC3
#define	EEPROM_VERSION				0xC4
#define	EEPROM_CUSTOMER_ID			0xC5
#define	EEPROM_RF_ANTENNA_OPT_88E		0xC9

